Autodesk.Revit.DB.ExportLineweightKey.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLineweightKey.OriginalLineweight
The original line weight.
Since:
2014

Autodesk.Revit.DB.ExportLineweightKey.#ctor(System.Int32)
Constructs a new default ExportLineweightKey using the original line weight as input.
originalLineweight:
The original line weight.
Since:
2014

Autodesk.Revit.DB.ExportLineweightKey.#ctor
Constructs a new default ExportLineweightKey.
Since:
2014

Autodesk.Revit.DB.ExportLineweightKey.#ctor(Autodesk.Revit.DB.ExportLineweightKey)
Constructs a new copy of the input ExportLineweightKey object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLineweightKey
A key used to represent an item stored in an Autodesk.Revit.DB.ExportLineweightTable.
Since:
2014